index.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en-us">

<head>
<title>Mathematical Functions - UPY</title>
<!-- 2017-05-17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gonzalo Peraza" />
<link href="http://gmpg.org/xfn/11" rel="profile">

<!-- CSS -->
<link rel="stylesheet" href="pages-html/public/css/poole.css">
<link rel="stylesheet" href="pages-html/public/css/syntax.css">
<link rel="stylesheet" href="pages-html/public/css/hyde.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface">

<!-- Icons -->
<link rel="apple-touch-icon" href="pages-html/public/UPY-favicon.png">
<link rel="shortcut icon" href="pages-html/public/favicon.ico">
<!-- Enable responsiveness on mobile devices-->
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1">
</head>
<body class="theme-base-upy">
<div id="preamble" class="sidebar">
<div class="container sidebar-sticky">
<div class="sidebar-about">
<h1>
<a href="index.html"> Mathematical Functions  </a>
</h1>
<p class="lead">A UPY Course</p>
</div>

<nav class="sidebar-nav">
<a class="sidebar-nav-item active" href="index.html">Home</a>
<a class="sidebar-nav-item" href="pages-html/syllabus_RA.html">Syllabus</a>
<a class="sidebar-nav-item" href="pages-html/lectures.html">Lectures</a>
<a class="sidebar-nav-item" href="pages-html/homework.html">Homework</a>
<a class="sidebar-nav-item" href="pages-html/grades.html">Grades</a>
<a class="sidebar-nav-item" href="https://github.com/gperaza/math-func-upy-2017">Github repo</a>
<span class="sidebar-nav-item">May-June 2017</span>
</nav>

<p>&copy; Gonzalo Peraza. 2017-05-01</p>
</div>
</div>
<div class="content container">
<div class="page"><h1 class="page-title">Mathematical Functions - UPY</h1>
<p class="message">A first course on functions, trigonometry, and vector algebra on the undergraduate level.</p>
<ul class="org-ul">
<li>Instructor: Gonzalo G. Peraza Mues
</li>
<li>email: <code>gonzalo.peraza@upy.edu.mx</code>
</li>
<li>Contents (Not necessarily in this order):
<ul class="org-ul">
<li>Functions
</li>
<li>Trigonometry
</li>
<li>Analytic Geometry
</li>
<li>Vector Algebra
</li>
</ul>
</li>
<li>Main references (freely available):
<ul class="org-ul">
<li><a href="https://sites.math.washington.edu/~m120/TheBook/TB2016.pdf">Precalculus</a> by Collingwood, Prince and Conroy. Content on functions and
trigonometry will follow this book.
</li>
<li><a href="http://immersivemath.com/ila/index.html">immersive linear algebra</a> by J. Ström, K. Åström,
and T. Akenine-Möller. Introduction to vector algebra will follow the first
chapters of this book.
</li>
</ul>
</li>
<li>Support references:
<ul class="org-ul">
<li>Álgebra y trigonometria con geometría analítica by Swokowski, E.
</li>
<li>Geometría plana y del espacio con trigonometría by Baldor, J.A.
</li>
<li><a href="https://openstax.org/details/algebra-and-trigonometry">Algebra and Trigonometry</a> published by openstax (free).
</li>
<li><a href="http://www.stitz-zeager.com/szprecalculus07042013.pdf">Precalculus</a> by Stitz and Zeager (free).
</li>
</ul>
</li>
</ul>
</div>
</div></body>
</html>
